{
	"certifications": "Node.js/Express.js, JavaScript/jQuery, React.js, HTML/CSS, SQL/NoSQL Databases",
	"skills": "Data Structures, Algorithms, Git, Python, JavaScript, C/C++, Java, MySQL, SQL Server, SQLite3, Snowflake, MongoDB, scikit-learn, Keras, TensorFlow, OpenCV, Transfer Learning ML, Supervised ML, Unsupervised ML, Django, Flask, Node, GraphQL, Vanilla JS, Redux, React, Next.js, SCSS, Electron.js, JavaFX, Jenkins, GitHub Actions, Netlify, Docker, Nginx, Auth (JWT)",
	"skillsMap_1": {
		"Programming Languages": "Python, SQL, Java, R, JavaScript",
		"Platforms/Tools": "Apache Airflow, Microsoft Power BI, Databricks, PySpark, Keras, Kafka, Docker",
		"Databases/Datawarehouses": "Microsoft SQL Server, Google BigQuery, Snowflake, MySQL"
	},
	"skillsMap_2": {
		"Business Intelligence Analytics": "Power BI, Streamlit",
		"Cloud Platforms": "Azure, AWS, GCP",
		"Machine/Deep Learning Tools": "scikit-learn, Keras, TensorFlow, PyTorch",
		"Deep Learning Experience": "CNN, NLP (LSTM), Generative Models, Transfer Learning",
		"Configuration Management": "Docker, Nginx",
		"Backend Development": "Django, Flask, NodeJS, REST APIs, GraphQL",
		"Frontend Development": "ReactJS, Next.js, Redux"
	},
	"educations": [
		{
			"name": "University of California Irvine",
			"id": "uci-masters",
			"duration": "Sep 2022-Dec 2023",
			"degreeType": "Masters of Data Science",
			"gpa": "3.57",
			"relevantCourses": "",
			"specialAwards": []
		},
		{
			"name": "Chapman University",
			"id": "chapman",
			"duration": "Sep 2019-May 2022",
			"degreeType": "B.S. / Bachelor of Software Engineering",
			"gpa": "3.63",
			"relevantCourses": "Data Structure & Algorithms (C++), Intro to computer science I & II (Python and Java), Intro to Linux/Unix Programming and Git, Software Requirements, Software Design, Discrete Math, Calculus I-III, Intro to Linear Algebra and Differential Equations, Intro to Statistics, Intro to 3D printing and modeling",
			"specialAwards": [ "Cum Laude", "Provost's List" ]
		},
		{
			"name": "University of San Diego",
			"id": "usd",
			"duration": "Sep 2014-Dec 2018",
			"degreeType": "B.B.A / Bachelor of Business Administration",
			"gpa": "3.56",
			"relevantCourses": "",
			"specialAwards": [
				"Academic Excellence in Business Administration",
				"Departmental Honors in Business Administration"
			]
		}
	],
	"experiences": [
		{
			"companyName": "Mr. Cooper",
			"id": "mrcooper",
			"location": "Dallas, TX (remote)",
			"duration": "June, 2023-Present",
			"position": "Machine Learning Engineer Intern, Enterprise Platform",
			"roles": [
				"Developed ETL pipelines on GCP Databricks using Python, SQL, and Airflow, enabling real-time Machine Learning Analysis.",
				"Modeled SQL Data Warehouse Tables on Google BigQuery to efficiently store GPT chatbot data in a structured format.",
				"Improved data pipeline efficiency and reduced associated costs by migrating ETL pipelines from Azure Data Factory (ADF) and SQL Server Integration Services (SSIS) to GCP Databricks.",
				"Developed Java Kafka pipelines, helping automate transitioning thousands of loans from originations to servicing."
			]
		},
		{
			"companyName": "Pacific Life Insurance",
			"id": "pacificLife_2",
			"location": "Newport Beach, CA",
			"duration": "May, 2022-June 2022",
			"position": "ETL Developer, Risk & Security Operations Corporate IT",
			"roles": [
				"Architected and implemented a solution consisting of a Microsoft SQL Server Database, Python ETL Program, & Microsoft Power BI Dashboard, providing near real-time insights for IT Business Executives and security analysts on endpoint security.",
				"The SQL database was designed using ER-diagramming and accommodated diverse data models.",
				"The ETL program extracts data from multiple sources via REST APIs and utilizes Python libraries & SQL to transform data.",
				"The Power BI Dashboard contains interactive visualizations with drill-down capabilities, allowing users custom datasets."
			]
		},
		{
			"companyName": "humanID",
			"id": "humanID_1",
			"location": "Cambridge, MA (remote)",
			"duration": "Jan 2021-Sep 2021",
			"position": "Software Developer Intern, Tech & Product Team",
			"roles": [
				"Implemented admin features using Python for the Developer Console of humanID, a Harvard non-profit startup supported by Mozilla with the mission of bringing one identity per person through its anonymous Single Sign-On (SSO) tool.",
				"These features empowered companies utilizing humanID’s SSO tool in their applications with improved user management.",
				"Developed a Docker container for Django & MySQL that standardized the development environment for developers."
			]
		},
		{
			"companyName": "Pacific Life Insurance",
			"id": "pacificLife",
			"location": "Newport Beach, CA",
			"duration": "Jan 2020-August 2020",
			"position": "Web Developer Intern, HatchLabs Division",
			"roles": [
				"Developed for an internal blog for the HatchLabs division of Pacific Life, serving as a centralized platform for employees to gain insights into the division's innovative projects.",
				"Built various UI pages using React.js and leveraged GraphQL to query data from Contentful CMS, enabling dynamic content rendering and seamless integration of data into the blog.",
				"Engineered a highly customizable React Grid component that became an integral part of the codebase by providing a flexible and consistent layout structure for nearly all pages and components, saving developer hours in development."
			]
		},
		{
			"companyName": "Forkaia",
			"id": "forkaia",
			"location": "Irvine, CA",
			"duration": "June 2019-Jan 2020",
			"position": "Software Engineer Intern",
			"roles": [
				"Engineered the backend user sign up and sign in authentication for 2 startup apps, A-Connect and 46andMix, using Node.js, Express.js, Mongo, Mongoose, JWT, and Bcrypt.",
				"Developed frontend UI pages and components for A-Connect with React.js and Bootstrap."
			]
		}
	],
	"research": [
		{
			"companyName": "Children’s Hospital of Orange County (CHOC)",
			"id": "CHOC",
			"location": "Orange, CA",
			"duration": "Sep 2023-Current",
			"position": "Research Intern",
			"roles": [
				"Feature engineer Histogram of Oriented Gradients (HOG) feature descriptors, utilized in explainable SVM models.",
				"Leveraged the TensorFlow Keras GradientTape API to determine which regions of images are most important for Deep Convolutional Neural Networks (CNNs.)",
				"Use Python to address the imbalanced dataset with augmentation transformation methods and generative AI models."
			]
		},
		{
			"companyName": "University of California, San Diego Airway Research and Clinical Trials Center",
			"id": "ucsd",
			"location": "San Diego, CA",
			"duration": "June 2017-May 2018",
			"position": "Undergraduate Researcher",
			"roles": [
				"Organize and input raw patient data, worked with medical staff to collect samples from patients, and performed spirometer respiratory function and DLCO tests on patients.",
				"Co-author of abstract: Abstract 2018 American Thoracic Society: Electronic Cigarette, Conventional Cigarette and Marijuana Use Patterns in San Diego County"
			]
		}
	]
}
