{
	"certifications": "Node.js/Express.js, JavaScript/jQuery, React.js, HTML/CSS, SQL/NoSQL Databases",
	"skills": "Data Structures & Algorithms, Git, Languages (Python, JavaScript, C/C++, Java), Databases (SQL - MySQL, MS SQL, SQLite3; MongoDB), REST API, GraphQL, Data Science/ML (scikit-learn, Keras, TensorFlow), Backend Development (Django, Node), Frontend Development (Vanilla JS, Redux, React, SCSS, Bootstrap), Desktop Development (Electron.js, JavaFX), CI/CD (Jenkins, GitHub Actions), CM (Docker, Nginx), Auth (JWT)",
	"educations": [
		{
			"name": "University of California Irvine",
			"id": "uci-masters",
			"duration": "09/15/22 - 12/20/23",
			"major": "Data Science",
			"degreeType": "Masters of Data Science",
			"gpa": "n/a",
			"relevantCourses": "",
			"specialAwards": []
		},
		{
			"name": "Chapman University",
			"id": "chapman",
			"duration": "09/01/19 - 05/20/22",
			"major": "Software Engineering",
			"degreeType": "Bachelor's of Science",
			"gpa": "3.5",
			"relevantCourses": "Data Structure & Algorithms (C++), Intro to computer science I & II (Python and Java), Intro to Linux/Unix Programming and Git, Software Requirements, Software Design, Discrete Math, Calculus I-III, Intro to Linear Algebra and Differential Equations, Intro to Statistics, Intro to 3D printing and modeling",
			"specialAwards": []
		},
		{
			"name": "University of San Diego",
			"id": "usd",
			"duration": "09/01/14 - 05/20/18",
			"major": "Business Administration",
			"degreeType": "Bachelor's of Arts",
			"gpa": "3.56",
			"relevantCourses": "",
			"specialAwards": [
				"Academic Excellence in Business Administration",
				"Departmental Honors in Business Administration"
			]
		},
		{
			"name": "University of California Irvine - Department of Continuing Education",
			"id": "uci",
			"duration": "08/01/18 - 10/20/20",
			"major": "The Coding Bootcamp",
			"degreeType": "Coding Certifications",
			"gpa": "n/a",
			"relevantCourses": "",
			"specialAwards": []
		}
	],
	"experiences": [
		{
			"companyName": "Pacific Life Insurance",
			"id": "pacificLife_2",
			"location": "Newport Beach, CA",
			"duration": "May, 2022 - current",
			"position": "Data Engineer Intern",
			"roles": [
				"Engineered a custom, dynamic data solution (Database & Dashboard) for Risk & Security Operations Corporate IT team which helps monitor and analyze endpoint device protection at Pacific Life.",
				"Created SRS documentation & diagrams of the dashboard and data mapping: extracting data from sources -> ETL -> data storage -> dashboard.",
				"Designed a database from scratch using Lucid Chart; implemented the designs and populated the tables. Created a Python automation script to extract data, transform data, and store the data in the database.",
				"Implemented Power BI dashboard & reports using the database as source."
			]
		},
		{
			"companyName": "humanID",
			"id": "humanID_2",
			"location": "Cambridge, MA",
			"duration": "Jan 2021-May 2021",
			"position": "Technical Lead - CTO (Volunteer)",
			"roles": [
				"Led the US team of software developer and project manager interns with SCRUM practices.",
				"Managed software projects throughout development, integration, and deployment.",
				"Projects completed: Setup Docker containers (Django & MySQL) for development, setup staging site for developer console, improved UI/UX of developer console, migrated SDK documentation to GitBook, setup a Discord webhook alarm for site down incidents",
				"Projects started: Automate CI/CD for developer console via GitHub Actions, CSS Style Guide, Synchronize data between DBs from microservices"
			]
		},
		{
			"companyName": "humanID",
			"id": "humanID_1",
			"location": "Cambridge, MA",
			"duration": "Jan 2021-May 2021",
			"position": "Software Developer Intern",
			"roles": [
				"Develop open-source software for humanID, a non-profit startup that works with Mozilla and Harvard.",
				"Develop the Developer Console web application for humanID with the Django framework, MySQL, JavaScript, HTML/CSS and more.",
				"Develop in a Docker environment and integrate code with AWS Hosting Platform (S3)"
			]
		},
		{
			"companyName": "Pacific Life Insurance",
			"id": "pacificLife",
			"location": "Newport Beach, CA",
			"duration": "Jan 2020-August 2020",
			"position": "Web Developer Intern",
			"roles": [
				"Build web applications using innovative technologies such as Node.js, React.js, SCSS/styled-components, GraphQL, Contentful CMS, Gatsby, Zapiar Webhook API Email Automation, Style Dictionary, Webflow, Bit.dev, Airtable, Mural, and more",
				"Built a custom React Grid Component (from scratch) that replaced the role of bootstrap columns and rows.",
				"Debug/troubleshoot existing code",
				"Work in quickly adapting environment based on Agile methodologies and SCRUM practices"
			]
		},
		{
			"companyName": "Forkaia",
			"id": "forkaia",
			"location": "Irvine, CA",
			"duration": "June 2019-Jan 2020",
			"position": "Startup Software Engineer Intern",
			"roles": [
				"Design apps and producing content for startup apps.",
				"Developed the backend user sign up and sign in authentication for 2 apps: A_Connect and 46andMix using Node.js, Express.js, Mongo, Mongoose, JWT, and Bcrypt. Developed some of the Front-End for A-Connect with React.js and Bootstrap."
			]
		},
		{
			"companyName": "University of California Irvine - The Coding Bootcamp",
			"id": "uci",
			"duration": "08/01/18 - 10/20/20",
			"position": "Bootcamp Student",
			"roles": [
				"An intensive 24-week long boot camp dedicated to designing and building web applications.",
				"Skills learned consisted of HTML5, CSS3, JavaScript, jQuery, Bootstrap, Firebase, NodeJs, MySQL, MongoDB, Express, Handlebars JS, & React Js.",
				"Note - 5 Coding Certifications (please refer to LinkedIn)"
			]
		},
		{
			"companyName": "University of California, San Diego Airway Research and Clinical Trials Center",
			"id": "ucsd",
			"position": "Undergraduate Researcher",
			"roles": [
				"Organize and input raw patient data, worked with medical staff to collect samples from patients, and performed spirometer respiratory function and DLCO tests on patients.",
				"Co-author of abstract: Abstract 2018 American Thoracic Society: Electronic Cigarette, Conventional Cigarette and Marijuana Use Patterns in San Diego County"
			]
		}
	]
}
